Repository: tivole/Numerary
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Root finding
ru: Поиск корней

source: Integral
ru: Интеграл

source: Minimum finding
ru: Поиск минимума

source: Maximum finding
ru: Поиск максимума

source: Linear System of Equations
ru: Линейная система уравнений

source: Nonlinear System of Equations
ru: Нелинейная система уравнений

source: Ordinary Differential Equations
ru: Обыкновенные дифференциальные уравнения.

source: Regression
ru: Регрессия

source: Interpolation
ru: Интерполяция

source: Differentiation
ru: Дифференцирование

source: Other
ru: Другие

source: Welcome to Numerary's documentation!
ru: Добро пожаловать в документацию Numerary!

source: Numerary is Scientific Library that contains many numerical methods.
ru: Numerary - это научная библиотека, которая содержит множество численных методов.

source: Contents
ru: Содержание
