Repository: tivole/Numerary
Catalog: docs/source/locale/*/LC_MESSAGES/linear-regression.po
Languages: ru

source: Linear Regression
ru: Линейная регрессия

source: Introduction
ru: Введение

source: In statistics, linear regression is a linear approach to modeling the relationship between a scalar response (or dependent variable) and one or more explanatory variables (or independent variables). The case of one explanatory variable is called simple linear regression. For more than one explanatory variable, the process is called multiple linear regression. This term is distinct from multivariate linear regression, where multiple correlated dependent variables are predicted, rather than a single scalar variable.
ru: В статистике линейная регрессия - это линейный подход к моделированию взаимосвязи между скалярным откликом (или зависимой переменной) и одной или несколькими независимыми переменными (или независимыми переменными). Случай одной независимой переменной называется простой линейной регрессией. Для нескольких независимых переменных процесс называется множественной линейной регрессией. Этот термин отличается от многомерной линейной регрессии, в которой прогнозируются несколько коррелированных зависимых переменных, а не одна скалярная переменная.

source: The Simple Linear Regression Model
ru: Модель простой линейной регрессии

source: The simplest deterministic mathematical relationship between two variables :math:`x` and :math:`y` is a linear relationship: :math:`y = \beta_0 + \beta_1 x`.
ru: Простейшая детерминированная математическая связь между двумя переменными :math:`x` и :math:`y` - это линейная зависимость: :math:`y = \beta_0 + \beta_1 x`.

source: The objective of this section is to develop an equivalent *linear probabilistic model*.
ru: Цель этого раздела - разработать эквивалентную *линейную вероятностную модель*.

source: If the two (random) variables are probabilistically related, then for a fixed value of x, there is uncertainty in the value of the second variable.
ru: Если две (случайные) переменные вероятностно связаны, то для фиксированного значения :math:`x` существует неопределенность в значении второй переменной.

source: So we assume :math:`Y = \beta_0 + \beta_1 x + \varepsilon`, where :math:`\varepsilon` is a random variable.
ru: Итак, мы предполагаем :math:`Y = \beta_0 + \beta_1 x + \varepsilon`, где :math:`\varepsilon` - случайная величина.

source: Two variables are related linearly “on average” if for fixed x the actual value of Y differs from its expected value by a random amount (i.e. there is random error).
ru: Две переменные связаны линейно «в среднем», если для фиксированного :math:`x` фактическое значение Y отличается от его ожидаемого значения на случайную величину (т.е. имеется случайная ошибка).

source: A Linear Probabilistic Model
ru: Линейная вероятностная модель

source: **Definition:** (The Simple Linear Regression Model)
ru: **Определение:** (Модель простой линейной регрессии)

source: There are parameters :math:`\beta_0`, :math:`\beta_1`, and :math:`\sigma^2`, such that for any fixed value of the independent variable :math:`x`, the dependent variable is a random variable related to :math:`x` through the model equation
ru: Существуют параметры :math:`\beta_0`, :math:`\beta_1` и :math:`\sigma^2`, такие, что для любого фиксированного значения независимой переменной :math:`x` зависимая переменная является случайной величиной, связанной с :math:`x` через уравнение модели

source: The quantity :math:`\varepsilon` in the model equation is the “error” - a random variable, assumed to be symmetrically distributed with
ru: Величина :math:`\varepsilon` в уравнении модели является «ошибкой» - случайной величиной, симметрично распределенной с

source: (no assumption made about the distribution of :math:`\varepsilon`, yet)
ru: (пока никаких предположений о распределении :math:`\varepsilon` не делалось)

source: :math:`\boldsymbol{X}`: the independent, predictor, or explanatory variable (usually known).
ru: :math:`\boldsymbol{X}`: независимая, предикторная или объясняющая переменная (обычно известная).

source: :math:`\boldsymbol{Y}`: the dependent or response variable. For fixed :math:`x`, :math:`Y` will be random variable.
ru: :math:`\boldsymbol{Y}`: зависимая переменная или переменная ответа. При фиксированном :math:`x`, :math:`Y` будет случайной величиной.

source: :math:`\boldsymbol{\varepsilon}`: the random deviation or random error term. For fixed :math:`x`, :math:`\varepsilon` will be random variable.
ru: :math:`\boldsymbol{\varepsilon}`: случайное отклонение или случайная ошибка. При фиксированном :math:`x`, :math:`\varepsilon` будет случайной величиной.

source: :math:`\boldsymbol{\beta_0}`: the average value of :math:`Y` when :math:`x` is zero (the intercept of the true regression line)
ru: :math:`\boldsymbol{\beta_0}`: среднее значение :math:`Y`, когда :math:`x` равно нулю (пересечение истинной линии регрессии)

source: :math:`\boldsymbol{\beta_1}`: the expected (average) change in :math:`Y` associated with a 1-unit increase in the value of :math:`x`. (the slope of the true regression line)
ru: ожидаемое (среднее) изменение :math:`Y`, связанное с увеличением на 1 единицу значения :math:`x`. (наклон истинной линии регрессии)

source: The points :math:`(x_1, y_1),\dots,(x_n, y_n)` resulting from :math:`n` independent observations will then be scattered about the true regression line:
ru: Точки :math:`(x_1, y_1),\dots,(x_n, y_n)`, полученные в результате :math:`n` независимых наблюдений, затем будут разбросаны вокруг истинной линии регрессии:

source: Estimating Model Parameters
ru: Оценка параметров модели

source: The values of :math:`\beta_0`, :math:`beta_1`, and :math:`sigma` will almost never be known to an investigator.
ru: Значения :math:`\beta_0`, :math:`\beta_1` и :math:`\sigma` почти никогда не будут известны исследователю.

source: Instead, sample data consists of n observed pairs :math:`(x_1, y_1),\dots,(x_n, y_n)` from which the model parameters and the true regression line itself can be estimated.
ru: Вместо этого выборочные данные состоят из :math:`n` наблюдаемых пар :math:`(x_1, y_1),\dots,(x_n, y_n)`, по которым можно оценить параметры модели и саму истинную линию регрессии.

source: The data (pairs) are assumed to have been obtained independently of one another.
ru: Предполагается, что данные (пары) были получены независимо друг от друга.

source: The “best fit” line is motivated by the principle of **least squares**, which can be traced back to the German mathematician **Gauss** (1777–1855):
ru: Линия «наилучшего соответствия» основана на принципе **наименьших квадратов**, который восходит к немецкому математику **Гауссу** (1777–1855):

source: A line provides the best fit to the data if the sum of the squared vertical distances (deviations) from the observed points to that line is as small as it can be.
ru: Линия обеспечивает наилучшее соответствие данным, если сумма квадратов вертикальных расстояний (отклонений) от наблюдаемых точек до этой линии настолько мала, насколько это возможно.

source: The sum of *squared vertical deviations* from the points :math:`(x_1, y_1),\dots,(x_n, y_n)`
ru: Сумма квадратов вертикальных отклонений от точек :math:`(x_1, y_1),\dots,(x_n, y_n)`

source: The point estimates of :math:`\beta_0` and :math:`\beta_1`, denoted by and, are called the least squares estimates – they are those values that minimize :math:`f(b_0, b_1)`.
ru: Точечные оценки :math:`\beta_0` и :math:`\beta_1`, обозначенные как и, называются оценками наименьших квадратов - это те значения, которые минимизируют :math:`f(b_0, b_1)`.

source: The fitted **regression line** or **least squares** line is then the line whose equation is :math:`y=\hat{\beta}_{0}+\hat{\beta}_{1} x`.
ru: Подгоняемая **линия регрессии** или линия **наименьших квадратов** - это линия, уравнение которой имеет вид :math:`y=\hat{\beta}_{0}+\hat{\beta}_{1} x`.

source: The minimizing values of :math:`b_0` and :math:`b_1` are found by taking partial derivatives of :math:`f(b_0, b_1)` with respect to both :math:`b_0` and :math:`b_1`, equating them both to zero [analogously to :math:`f'(b)=0` in univariate calculus], and solving the equations
ru: Минимизирующие значения :math:`b_0` и :math:`b_1` находятся путем взятия частных производных от :math:`f(b_0, b_1)` как по :math:`b_0`, так и по :math:`b_1`, приравнивания их обоих к нулю [аналогично :math:`f'(b)=0` в одномерном исчислении] и решения уравнения

source: The least squares estimate of the slope coefficient :math:`\beta_1` of the true regression line is
ru: Оценка методом наименьших квадратов коэффициента наклона :math:`\beta_1` истинной линии регрессии равна

source: *Shortcut formulas* for the numerator and denominator of :math:`\hat{\beta_1}` are
ru: Краткие формулы для числителя и знаменателя :math:`\hat{\beta_1}`:

source: The least squares estimate of the intercept :math:`b_0` of the true regression line is
ru: Оценка методом наименьших квадратов точки пересечения :math:`b_0` истинной линии регрессии равна

source: Usage
ru: Использование

source: Imagine that we have following points and we want to build a linear regression model:
ru: Представьте, что у нас есть следующие точки, и мы хотим построить линейную регрессионную модель:

source: Then the code will look like this:
ru: Тогда код будет выглядеть так:
