Repository: tivole/Numerary
Catalog: docs/source/locale/*/LC_MESSAGES/newton-method.po
Languages: ru

source: Newton's Method
ru: Метод Ньютона

source: Overview
ru: Обзор

source: **Newton’s method** is one of the most popular numerical methods, and is even referred by *Burden* and *Faires* as the most powerful method that is used to solve for the equation :math:`f(x) = 0`. This method originates from the *Taylor’s series* expansion of the function :math:`f(x)` about the point :math:`x1`:
ru: **Метод Ньютона** - один из самых популярных численных методов, и Бёрден и Фейрес даже называют его самым мощным методом, который используется для решения уравнения :math:`f(x) = 0`. Этот метод основан на разложении в ряд Тейлора функции :math:`f(x)` относительно точки :math:`x_1`:

source: where :math:`f`, and its first and second order derivatives, :math:`f'` and :math:`f''` are calculated at :math:`x_1`. If we take the first two terms of the Taylor’s series expansion we have:
ru: где :math:`f`, а также его производные первого и второго порядка, :math:`f'` и :math:`f'` вычисляются в :math:`x_1`. Если мы возьмем первые два члена разложения в ряд Тейлора, мы получим:

source: We then set previous expression to zero (i.e :math:`f(x) = 0` ) to find the root of the equation which gives us:
ru: Затем мы устанавливаем предыдущее выражение равным нулю (т.е. :math:`f(x) = 0`), чтобы найти корень уравнения, которое дает нам:

source: Rearranging the previous expression we obtain the next approximation to the root, giving us:
ru: Переставляя предыдущее выражение, мы получаем следующее приближение к корню, что дает нам:

source: Thus generalizing previous expression we obtain Newton’s iterative method:
ru: Таким образом, обобщая предыдущее выражение, мы получаем итерационный метод Ньютона:

source: where :math:`x_{i} \rightarrow \bar{x}` (as :math:`i \rightarrow \infty`), and :math:`x` is the approximation to a root of the function :math:`f(x)`.
ru: где :math:`x_{i} \rightarrow \bar{x}` (при :math:`i \rightarrow \infty`), а x - приближение к корню функции f (x).

source: **Note:** As the iterations begin to have the same repeated values i.e. as :math:`x_i = x_{i+1} = \bar{x}` this is an indication that :math:`f(x)` converges to :math:`\bar{x}`. Thus :math:`x_i` is the root of the function :math:`f(x)`.
ru: **Примечание:** Поскольку итерации начинают иметь одинаковые повторяющиеся значения, т.е. как :math:`x_i = x_{i+1} = \bar{x}`, это указывает на то, что :math:`f(x)` сходится к :math:`\bar{x}`. Таким образом, :math:`x_i` - это корень функции :math:`f(x)`.

source: The Method
ru: Метод

source: Step 1:
ru: Шаг 1:

source: Let :math:`\mathbf{x}^{(0)}=\left(x_{1}^{(0)}, x_{2}^{(0)}, \ldots, x_{n}^{(0)}\right)` be a given initial vector.
ru: Пусть :math:`\mathbf{x}^{(0)}=\left(x_{1}^{(0)}, x_{2}^{(0)}, \ldots, x_{n}^{(0)}\right)` - заданный начальный вектор.

source: Step 2:
ru: Шаг 2:

source: Calculate :math:`J\left(\mathbf{x}^{(0)}\right)` and :math:`\mathbf{F}\left(\mathbf{x}^{(0)}\right)`.
ru: Вычислите :math:`J\left(\mathbf{x}^{(0)}\right)` и :math:`\mathbf{F}\left(\mathbf{x}^{(0)}\right)`.

source: Step 3:
ru: Шаг 3:

source: We now have to calculate the vector :math:`\mathbf{y}^{(0)}`, where
ru: Теперь нам нужно вычислить вектор :math:`\mathbf{y}^{(0)}`, где

source: In order to find :math:`\mathbf{y}^{(0)}`, we solve the linear system :math:`J\left(\mathbf{x}^{(0)}\right) \mathbf{y}^{(0)}=-\mathbf{F}\left(\mathbf{x}^{(0)}\right)`, using Gaussian Elimination.
ru: Чтобы найти :math:`\mathbf{y}^{(0)}`, мы решаем линейную систему :math:`J\left(\mathbf{x}^{(0)}\right) \mathbf{y}^{(0)}=-\mathbf{F}\left(\mathbf{x}^{(0)}\right)`используя метод исключения Гаусса.

source: **Note:** Rearranging the system in *Step 3*, we get that :math:`\mathbf{y}^{(0)}=-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)`. The significance of this is that, since :math:`\mathbf{y}^{(0)}=-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)`, we can replace :math:`-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)` in our iterative formula with :math:`\mathbf{y}^{(0)}`. This result will yield that
ru: **Примечание:** преобразовав систему на *шаге 3*, мы получим :math:`\mathbf{y}^{(0)}=-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)`. Значение этого состоит в том, что, поскольку math:`\mathbf{y}^{(0)}=-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)`, мы можем заменить :math:`-J\left(\mathbf{x}^{(0)}\right)^{-1} \mathbf{F}\left(\mathbf{x}^{(0)}\right)` в наша итерационная формула с :math:`\mathbf{y}^{(0)}`. Этот результат даст, что

source: Step 4:
ru: Шаг 4:

source: Once :math:`\mathbf{y}^{(0)}` is found, we can now proceed to finish the first iteration by solving for :math:`\mathbf{x}^{(1)}`. Thus using the result from *Step 3*, we have that
ru: Как только :math:`\mathbf{y}^{(0)}` найден, мы можем приступить к завершению первой итерации, решив для :math:`\mathbf{x}^{(1)}`. Таким образом, используя результат *шага 3*, мы имеем

source: Step 5:
ru: Шаг 5:

source: Once we have calculated :math:`\mathbf{x}^{(1)}`, we repeat the process again, until :math:`\mathbf{x}^{(k)}` converges to :math:`\bar{x}`. This indicates we have reached the solution to :math:`\mathbf{F}(\mathbf{x})=\mathbf{0}`, where :math:`\bar{x}` is the solution to the system.
ru: После того, как мы вычислили :math:`\mathbf{x}^{(1)}`, мы повторяем процесс снова, пока :math:`\mathbf{x}^{(k)}` не сходится к :math:`\bar{x}`. Это указывает на то, что мы достигли решения :math:`\mathbf{F}(\mathbf{x})=\mathbf{0}`, где :math:`\bar{x}` - решение системы.

source: **Note:** When a set of vectors converges, the norm :math:`\left\|\mathbf{x}^{(k)}-\mathbf{x}^{(k-1)}\right\|=0`. This means that
ru: Примечание: когда набор векторов сходится, норма :math:`\left\|\mathbf{x}^{(k)}-\mathbf{x}^{(k-1)}\right\|=0`. Это означает, что

source: Usage
ru: Использование

source: imagine that we want to solve the following nonlinear system of equations:
ru: представьте, что мы хотим решить следующую нелинейную систему уравнений:

source: then the code will look like this:
ru: тогда код будет выглядеть так:
