Repository: tivole/Numerary
Catalog: docs/source/locale/*/LC_MESSAGES/root-bisection-method.po
Languages: ru

source: Bisection Method
ru: Метод деления пополам

source: Overview
ru: Обзор

source: In mathematics, the **bisection method** is a root-finding method that applies to any continuous functions for which one knows two values with opposite signs. The method consists of repeatedly bisecting the interval defined by these values and then selecting the subinterval in which the function changes sign, and therefore must contain a root. It is a very simple and robust method, but it is also relatively slow. Because of this, it is often used to obtain a rough approximation to a solution which is then used as a starting point for more rapidly converging methods. The method is also called the **interval halving method**, the **binary search method**, or the **dichotomy method**.
ru: В математике **метод деления пополам** - это метод поиска корней, который применяется к любым непрерывным функциям, для которых известны два значения с противоположными знаками. Метод состоит из многократного деления пополам интервала, определяемого этими значениями, и последующего выбора подинтервала, в котором функция меняет знак и, следовательно, должна содержать корень. Это очень простой и надежный метод, но он также относительно медленный. Из-за этого его часто используют для получения грубого приближения к решению, которое затем используется в качестве отправной точки для более быстро сходящихся методов. Этот метод также называют **методом деления интервала вдвое**, **методом двоичного поиска** или **методом дихотомии**.

source: The Method
ru: Метод

source: The method is applicable for numerically solving the equation :math:`f(x) = 0` for the real variable :math:`x`, where :math:`f` is a continuous function defined on an interval :math:`[a, b]` and where :math:`f(a)` and :math:`f(b)` have opposite signs. In this case :math:`a` and :math:`b` are said to bracket a root since, by the intermediate value theorem, the continuous function :math:`f` must have at least one root in the interval :math:`(a, b)`.
ru: Метод применим для численного решения уравнения :math:`f(x) для действительной переменной :math:`x`,, где :math:`f` - непрерывная функция, определенная на интервале :math:`[a, b]`, а :math:`f(a)` и :math:`f(b)` имеют противоположные знаки. . В этом случае говорят, что :math:`a` и :math:`b` заключают в скобки корень, поскольку по теореме о промежуточном значении непрерывная функция :math:`f` должна иметь хотя бы один корень в интервале :math:`(a, b)`.

source: At each step the method divides the interval in two by computing the midpoint :math:`c = \frac{a+b}{2}` of the interval and the value of the function :math:`f(c)` at that point. Unless :math:`c` is itself a root (which is very unlikely, but possible) there are now only two possibilities: either :math:`f(a)` and :math:`f(c)` have opposite signs and bracket a root, or :math:`f(c)` and :math:`f(b)` have opposite signs and bracket a root. The method selects the subinterval that is guaranteed to be a bracket as the new interval to be used in the next step. In this way an interval that contains a zero of :math:`f` is reduced in width by *50%* at each step. The process is continued until the interval is sufficiently small.
ru: На каждом шаге метод делит интервал на две части, вычисляя среднюю точку :math:`c = \frac{a+b}{2}` интервала и значение функции :math:`f(c)` в этой точке. Если только c не является корнем (что очень маловероятно, но возможно), теперь есть только две возможности: либо :math:`f(a)` и :math:`f(c)` имеют противоположные знаки и скобки для корня, либо :math:`f(c)` и :math:`f(b)` иметь противоположные знаки и заключать в скобки корень. Метод выбирает подинтервал, который гарантированно является скобкой, в качестве нового интервала, который будет использоваться на следующем шаге. Таким образом, интервал, содержащий ноль :math:`f`, уменьшается по ширине на *50%* на каждом шаге. Процесс продолжается до тех пор, пока интервал не станет достаточно малым.

source: Explicitly, if :math:`f(a)` and :math:`f(c)` have opposite signs, then the method sets :math:`c` as the new value for :math:`b`, and if :math:`f(b)` and :math:`f(c)` have opposite signs then the method sets :math:`c` as the new :math:`a`. (If :math:`f(c)=0` then :math:`c` may be taken as the solution and the process stops.) In both cases, the new :math:`f(a)` and :math:`f(b)` have opposite signs, so the method is applicable to this smaller interval.
ru: Явно, если :math:`f(a)` и :math:`f(c)` имеют противоположные знаки, тогда метод устанавливает :math:`c` как новое значение для :math:`b`, а если :math:`f(b)` и :math:`f(c)` имеют противоположные знаки, то метод устанавливает c как новое значение а. (Если :math:`f(c) = 0`, то c может быть принято как решение, и процесс останавливается.) В обоих случаях новые :math:`f(a)` и :math:`f(b)` имеют противоположные знаки, поэтому метод применим к этому меньшему интервалу .

source: Iteration Tasks
ru: Итерационные задачи

source: Calculate :math:`c`, the midpoint of the interval, :math:`c=\frac{a+b}{2}`.
ru: Вычислите :math:`c`, середину интервала, :math:`c=\frac{a+b}{2}`.

source: Calculate the function value at the midpoint, :math:`f(c)`.
ru: Вычислить значение функции в средней точке, :math:`f(c)`.

source: If convergence is satisfactory (that is, :math:`c-a` is sufficiently small, or :math:`|f(c)|` is sufficiently small), return :math:`c` and stop iterating.
ru: Если сходимость удовлетворительная (т. е. :math:`c-a` достаточно мало или :math:`|f(c)|` достаточно мало), верните c и прекратите повторение.

source: Examine the sign of :math:`f(c)` and replace either :math:`(a, f(a))` or :math:`(b, f(b))` with :math:`(c, f(c))` so that there is a zero crossing within the new interval.
ru: Изучите знак :math:`f(c)` и замените :math:`(a, f(a))` или :math:`(b, f(b))` на :math:`(c, f(c))` так, чтобы в новом интервале было пересечение нуля.

source: Usage
ru: Использование

source: Imagine that we want to find the root of the following function:
ru: Представьте, что мы хотим найти корень следующей функции:

source: Then the code will look like this:
ru: Тогда код будет выглядеть так:
