Repository: tivole/Numerary
Catalog: docs/source/locale/*/LC_MESSAGES/root-secant-method.po
Languages: ru

source: Secant Method
ru: Метод хорд

source: Overview
ru: Обзор

source: In numerical analysis, the **secant method** is a root-finding algorithm that uses a succession of roots of secant lines to better approximate a root of a function :math:`f`. The secant method can be thought of as a finite-difference approximation of Newton's method. However, the method was developed independently of Newton's method and predates it by over 3000 years.
ru: В численном анализе **метод секущих** - это алгоритм поиска корней, который использует последовательность корней секущих линий для лучшего приближения корня функции :math:`f`. Метод секущих можно рассматривать как конечно-разностную аппроксимацию метода Ньютона. Однако этот метод был разработан независимо от метода Ньютона и предшествовал ему более чем на 3000 лет.

source: The Method
ru: Метод

source: The secant method is defined by the recurrence relation
ru: Метод секанса определяется рекуррентным соотношением

source: As can be seen from the recurrence relation, the secant method requires two initial values, :math:`x_0` and :math:`x_1`, which should ideally be chosen to lie close to the root.
ru: Как видно из рекуррентного соотношения, метод секущей требует двух начальных значений :math:`x_0` и :math:`x_1`, которые в идеале следует выбирать так, чтобы они лежали близко к корню.

source: Derivation Of The Method
ru: Вывод метода

source: Starting with initial values :math:`x_0`` and :math:`x_1`, we construct a line through the points :math:`(x0, f(x0))` and :math:`(x1, f(x1))`, as shown in the picture above. In slope–intercept form, the equation of this line is
ru: Начиная с начальных значений :math:`x_0` и :math:`x_1`, мы строим линию через точки :math:`(x0, f(x0))` and :math:`(x1, f(x1))`, как показано на рисунке выше. В форме наклон-пересечение уравнение этой прямой имеет вид

source: The root of this linear function, that is the value of :math:`x` such that :math:`y=0` is
ru: Корень этой линейной функции, то есть значение :math:`x` такое, что :math:`y=0`, равно

source: We then use this new value of :math:`x` as :math:`x_2` and repeat the process, using :math:`x_1` and :math:`x_2` instead of :math:`x_0` and :math:`x_1`. We continue this process, solving for :math:`x_3`, :math:`x_4`, etc., until we reach a sufficiently high level of precision (a sufficiently small difference between :math:`x_n` and :math:`x_n-1`):
ru: Затем мы используем это новое значение :math:`x` как :math:`x_2` и повторяем процесс, используя :math:`x_1` и :math:`x_2` вместо :math:`x_0` и :math:`x_1`. Мы продолжаем этот процесс, решая для :math:`x_3`, :math:`x_4` и т. Д., Пока не достигнем достаточно высокого уровня точности (достаточно малая разница между :math:`x_n` и :math:`x_n-1`):

source: Usage
ru: Использование

source: Imagine that we want to minimize the following function:
ru: Представьте, что мы хотим минимизировать следующую функцию:

source: Then the code will look like this:
ru: Тогда код будет выглядеть так:
